#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

// 在屏幕上打印杨辉三角。
//1                   
//1 1
//1 2 1
//1 3 3 1
//1 4 6 4 1
//……
//   1   实际的规律如此
//  1 1
// 1 2 1
//1 3 3 1


// 自己觉得是最佳法
//int main()
//{
//    // 看了提示后，先创建99*99的数组
//    int arr[99][99] = { 0 };
//    // 个人思路：
//    int n = 0;
//    scanf("%d", &n);
//    // 先初始化指定位置(该指定位置并不是从数组下标0为开始！！！          现在觉得不好
//    // 个人觉得这样清晰)的三角，交给所有元素置为1
//    int i = 0;
//    int j = 0;
//    // 规律：第i行有i个元素，控制行数
//    for (i = 1; i <= n; i++) {
//        // j控制每行的打印，第i行打印i个元素
//        for (j = 1; j <= i; j++) {
//            arr[i][j] = 1;
//        }
//    }
//    
//    // 将指定位置i，j位置的元素改变为(arr[i-1][j-1] + arr[i-1][j])
//    // 找规律得从第三行开始改变
//    for (i = 3; i <= n; i++) {
//        // 每行从第二个元素改变至倒数第二个元素
//        for (j = 2; j <= i - 1; j++) {
//            arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
//        }
//    }
//
//    for (i = 1; i <= n; i++) {
//        for (j = 1; j <= i; j++) {
//            // 以%2d打印，预留两个字符空间，为了使出现两位数时也可以对齐
//            printf("%2d ", arr[i][j]);
//        }
//        printf("\n");
//    }
//
//    return 0;
//}



// 老师讲的方法（小改动，老师写的见笔记）：（法二）自己觉得也是最佳法
int main()
{
    // 看了提示后，先创建99*99的数组
    int arr[99][99] = { 0 };
    // 个人思路：（利用数组指定位置，打印的时候相对应，该指定位置并不是从数组下标为开始）
    // 感觉这样比老师写的好理解
    int n = 0;
    scanf("%d", &n);

    // 规律：第i行有i个元素，控制行数
    int i = 0;
    // j控制每行的打印，第i行打印i个元素
    int j = 0;
    for (i = 1; i <= n; i++) {
        for (j = 1; j <= i; j++) {
            if (1 == j) {
                arr[i][j] = 1;
            }
            else if (i == j) {
                arr[i][j] = 1;
            }
            else {
                arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
            }
            // 这里直接打印！！！！！！
            // 以%2d打印，预留两个字符空间，为了使出现两位数时也可以对齐
            printf("%2d ", arr[i][j]);

        }// 内层for循环结尾
        printf("\n");
    }// 外层for循环结尾

    return 0;
}



// 看答案提示还有一种方法：方法三，用一维数组构建一行打印一行（没写出来）
// 自己顺思路写：
//int main()
//{
//    int arr[99] = { 0 };
//    int n = 0;
//    scanf("%d", &n);
//    int i = 0;
//    int j = 0;
//    // 看了答案先将最高处的1直接打印
//    printf("1\n");
//    for (i = 1; i <= n; i++) {
//        arr[0] = 1;
//        for (j = 2; j <= i - 1; j++) {
//            // 卡住了，不会
//        }
//        arr[i] = 1;
//    }
//
//    return 0;
//}